#include <iostream>

using namespace std;

/*
3. Да се напише програма, която прочита цяло число от клавиатурата, 
което се тълкува като година (напр. 2009). 
Да се провери дали годината е високосна и ако е така, 
на екрана да се изведе „Yes“, а в противен случай да се изведе „No“. 
Една година е високосна ако се дели на 4. 
Ако обаче се дели на 100, тогава е високосна ако се дели и на 400. 
Например, високосни са 1600, 2000, 2004. Не са високосни 1900, 1993, 2009.
*/

int main()
{
    int inputYear;
    
    cin >> inputYear;

    if (inputYear % 4 == 0)
    {
        if (inputYear % 100 == 0)
        {
            if (inputYear % 400 == 0)
            {
                cout << "Yes" << endl;
            }
            else
            {
                cout << "No" << endl;
            }
        }
        else
        {
            cout << "Yes" << endl;
        }
    }
    else
    {
        cout << "No" << endl;
    }
}