#include <iostream>

using namespace std;

/*
1. Да се напише програма, която организира for цикъл, който се повтаря 5 пъти.
Вътре в цикъла (всеки път) да се въвежда едно число. Ако въведеното число е по-малко
от 5, да се преминава към следваща стъпка на цикъла. Ако числото е по-голямо от 1000,
цикълът да се прекратява. Във всички останали случаи - да се извежда въведеното число
умножено по 5.
*/

int main()
{
    int inputNumber;

    for (int i = 0; i < 5; i++)
    {
        cin >> inputNumber;

        if (inputNumber < 5)
        {
            continue;
        }

        if (inputNumber > 1000)
        {
            break;
        }

        cout << inputNumber * 5 << endl;
    }
}