#include <iostream>

using namespace std;

/*
2. Да се напише програма, която извежда всички комбинации без повторения
на хипотетично тото 3 от 10, т.е. от 10 топки се теглят 3, топките не се връщат
и редът няма значение. В този смисъл комбинациите 1, 2, 3; 3, 2, 1; 1, 3, 2 и т.н.
са еднакви и трябва да се изведе само една от тях, а например 3, 1, 3 е невъзможна
комбинация (топките не могат да се повтарят в една комбинация).
*/

int main()
{
    for (int num1 = 1; num1 <= 8; num1++)
    {
        for (int num2 = num1 + 1; num2 <= 9; num2++)
        {
            for (int num3 = num2 + 1; num3 <= 10; num3++)
            {
                cout << num1 << " " << num2 << " " << num3 << endl;
            }
        }
    }
}